MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ0512EFK144/mcu.h
extern volatile __ADCCMPCON5bits_t ADCCMPCON5bits __asm__ ("ADCCMPCON5") __attribute__((section("sfrs"), address(0xBF84B0B0)));
#define ADCCMPCON6 ADCCMPCON6
extern volatile uint32_t   ADCCMPCON6 __attribute__((section("sfrs"), address(0xBF84B0B4)));
typedef struct {
  uint32_t IELOLO:1;
  uint32_t IELOHI:1;
  uint32_t IEHILO:1;
  uint32_t IEHIHI:1;
  uint32_t IEBTWN:1;
  uint32_t DCMPED:1;
  uint32_t DCMPGIEN:1;
  uint32_t ENDCMP:1;
  uint32_t AINID:5;
} __ADCCMPCON6bits_t;
extern volatile __ADCCMPCON6bits_t ADCCMPCON6bits __asm__ ("ADCCMPCON6") __attribute__((section("sfrs"), address(0xBF84B0B4)));
#define ADCFSTAT ADCFSTAT
extern volatile uint32_t   ADCFSTAT __attribute__((section("sfrs"), address(0xBF84B0B8)));
typedef struct {
  uint32_t ADCID:3;
  uint32_t :4;
  uint32_t FSIGN:1;
  uint32_t FCNT:8;
  uint32_t :5;
  uint32_t FWROVERR:1;
  uint32_t FRDY:1;
  uint32_t FIEN:1;
  uint32_t ADC0EN:1;
  uint32_t ADC1EN:1;
  uint32_t ADC2EN:1;
  uint32_t ADC3EN:1;
  uint32_t ADC4EN:1;
  uint32_t :2;
  uint32_t FEN:1;
} __ADCFSTATbits_t;
extern volatile __ADCFSTATbits_t ADCFSTATbits __asm__ ("ADCFSTAT") __attribute__((section("sfrs"), address(0xBF84B0B8)));
#define ADCFIFO ADCFIFO
extern volatile uint32_t   ADCFIFO __attribute__((section("sfrs"), address(0xBF84B0BC)));
typedef struct {
  uint32_t DATA:32;
} __ADCFIFObits_t;
extern volatile __ADCFIFObits_t ADCFIFObits __asm__ ("ADCFIFO") __attribute__((section("sfrs"), address(0xBF84B0BC)));
#define ADCBASE ADCBASE
extern volatile uint32_t   ADCBASE __attribute__((section("sfrs"), address(0xBF84B0C0)));
typedef struct {
  uint32_t ADCBASE:16;
} __ADCBASEbits_t;
extern volatile __ADCBASEbits_t ADCBASEbits __asm__ ("ADCBASE") __attribute__((section("sfrs"), address(0xBF84B0C0)));
#define ADCTRGSNS ADCTRGSNS
extern volatile uint32_t   ADCTRGSNS __attribute__((section("sfrs"), address(0xBF84B0D0)));
typedef struct {
  uint32_t LVL0:1;
  uint32_t LVL1:1;
  uint32_t LVL2:1;
  uint32_t LVL3:1;
  uint32_t LVL4:1;
  uint32_t LVL5:1;
  uint32_t LVL6:1;
  uint32_t LVL7:1;
  uint32_t LVL8:1;
  uint32_t LVL9:1;
  uint32_t LVL10:1;
  uint32_t LVL11:1;
} __ADCTRGSNSbits_t;
extern volatile __ADCTRGSNSbits_t ADCTRGSNSbits __asm__ ("ADCTRGSNS") __attribute__((section("sfrs"), address(0xBF84B0D0)));
#define ADC0TIME ADC0TIME
extern volatile uint32_t   ADC0TIME __attribute__((section("sfrs"), address(0xBF84B0D4)));
typedef struct {
  uint32_t SAMC:10;
  uint32_t :6;
  uint32_t ADCDIV:7;
  uint32_t :1;
  uint32_t SELRES:2;
  uint32_t ADCEIS:3;
} __ADC0TIMEbits_t;
extern volatile __ADC0TIMEbits_t ADC0TIMEbits __asm__ ("ADC0TIME") __attribute__((section("sfrs"), address(0xBF84B0D4)));
#define ADC1TIME ADC1TIME
extern volatile uint32_t   ADC1TIME __attribute__((section("sfrs"), address(0xBF84B0D8)));
typedef struct {
  uint32_t SAMC:10;
  uint32_t :6;
  uint32_t ADCDIV:7;
  uint32_t :1;
  uint32_t SELRES:2;
  uint32_t ADCEIS:3;
} __ADC1TIMEbits_t;
extern volatile __ADC1TIMEbits_t ADC1TIMEbits __asm__ ("ADC1TIME") __attribute__((section("sfrs"), address(0xBF84B0D8)));
#define ADC2TIME ADC2TIME
extern volatile uint32_t   ADC2TIME __attribute__((section("sfrs"), address(0xBF84B0DC)));
typedef struct {
  uint32_t SAMC:10;
  uint32_t :6;
  uint32_t ADCDIV:7;
  uint32_t :1;
  uint32_t SELRES:2;
  uint32_t ADCEIS:3;
} __ADC2TIMEbits_t;
extern volatile __ADC2TIMEbits_t ADC2TIMEbits __asm__ ("ADC2TIME") __attribute__((section("sfrs"), address(0xBF84B0DC)));
#define ADC3TIME ADC3TIME
extern volatile uint32_t   ADC3TIME __attribute__((section("sfrs"), address(0xBF84B0E0)));
typedef struct {
  uint32_t SAMC:10;
  uint32_t :6;
  uint32_t ADCDIV:7;
  uint32_t :1;
  uint32_t SELRES:2;
  uint32_t ADCEIS:3;
} __ADC3TIMEbits_t;
extern volatile __ADC3TIMEbits_t ADC3TIMEbits __asm__ ("ADC3TIME") __attribute__((section("sfrs"), address(0xBF84B0E0)));
#define ADC4TIME ADC4TIME
extern volatile uint32_t   ADC4TIME __attribute__((section("sfrs"), address(0xBF84B0E4)));
typedef struct {
  uint32_t SAMC:10;
  uint32_t :6;
  uint32_t ADCDIV:7;
  uint32_t :1;
  uint32_t SELRES:2;
  uint32_t ADCEIS:3;
} __ADC4TIMEbits_t;
extern volatile __ADC4TIMEbits_t ADC4TIMEbits __asm__ ("ADC4TIME") __attribute__((section("sfrs"), address(0xBF84B0E4)));
#define ADCEIEN1 ADCEIEN1
extern volatile uint32_t   ADCEIEN1 __attribute__((section("sfrs"), address(0xBF84B0F0)));
typedef struct {
  uint32_t EIEN0:1;
  uint32_t EIEN1:1;
  uint32_t EIEN2:1;
  uint32_t EIEN3:1;
  uint32_t EIEN4:1;
  uint32_t EIEN5:1;
  uint32_t EIEN6:1;
  uint32_t EIEN7:1;
  uint32_t EIEN8:1;
  uint32_t EIEN9:1;
  uint32_t EIEN10:1;
  uint32_t EIEN11:1;
  uint32_t EIEN12:1;
  uint32_t EIEN13:1;
  uint32_t EIEN14:1;
  uint32_t EIEN15:1;
  uint32_t EIEN16:1;
  uint32_t EIEN17:1;
  uint32_t EIEN18:1;
  uint32_t EIEN19:1;
  uint32_t EIEN20:1;
  uint32_t EIEN21:1;
  uint32_t EIEN22:1;
  uint32_t EIEN23:1;
  uint32_t EIEN24:1;
  uint32_t EIEN25:1;
  uint32_t EIEN26:1;
  uint32_t EIEN27:1;
  uint32_t EIEN28:1;
  uint32_t EIEN29:1;
  uint32_t EIEN30:1;
  uint32_t EIEN31:1;
} __ADCEIEN1bits_t;
extern volatile __ADCEIEN1bits_t ADCEIEN1bits __asm__ ("ADCEIEN1") __attribute__((section("sfrs"), address(0xBF84B0F0)));
#define ADCEIEN2 ADCEIEN2
extern volatile uint32_t   ADCEIEN2 __attribute__((section("sfrs"), address(0xBF84B0F4)));
typedef struct {
  uint32_t EIEN32:1;
  uint32_t EIEN33:1;
  uint32_t EIEN34:1;
  uint32_t EIEN35:1;
  uint32_t EIEN36:1;
  uint32_t EIEN37:1;
  uint32_t EIEN38:1;
  uint32_t EIEN39:1;
  uint32_t EIEN40:1;
  uint32_t EIEN41:1;
  uint32_t EIEN42:1;
  uint32_t EIEN43:1;
  uint32_t EIEN44:1;
} __ADCEIEN2bits_t;
extern volatile __ADCEIEN2bits_t ADCEIEN2bits __asm__ ("ADCEIEN2") __attribute__((section("sfrs"), address(0xBF84B0F4)));
#define ADCEISTAT1 ADCEISTAT1
extern volatile uint32_t   ADCEISTAT1 __attribute__((section("sfrs"), address(0xBF84B0F8)));
typedef struct {
  uint32_t EIRDY0:1;
  uint32_t EIRDY1:1;
  uint32_t EIRDY2:1;
  uint32_t EIRDY3:1;
  uint32_t EIRDY4:1;
  uint32_t EIRDY5:1;
  uint32_t EIRDY6:1;
  uint32_t EIRDY7:1;
  uint32_t EIRDY8:1;
  uint32_t EIRDY9:1;
  uint32_t EIRDY10:1;
  uint32_t EIRDY11:1;
  uint32_t EIRDY12:1;
  uint32_t EIRDY13:1;
  uint32_t EIRDY14:1;
  uint32_t EIRDY15:1;
  uint32_t EIRDY16:1;
  uint32_t EIRDY17:1;
  uint32_t EIRDY18:1;
  uint32_t EIRDY19:1;
  uint32_t EIRDY20:1;
  uint32_t EIRDY21:1;
  uint32_t EIRDY22:1;
  uint32_t EIRDY23:1;
  uint32_t EIRDY24:1;
  uint32_t EIRDY25:1;
  uint32_t EIRDY26:1;
  uint32_t EIRDY27:1;
  uint32_t EIRDY28:1;
  uint32_t EIRDY29:1;
  uint32_t EIRDY30:1;
  uint32_t EIRDY31:1;
} __ADCEISTAT1bits_t;
extern volatile __ADCEISTAT1bits_t ADCEISTAT1bits __asm__ ("ADCEISTAT1") __attribute__((section("sfrs"), address(0xBF84B0F8)));
#define ADCEISTAT2 ADCEISTAT2
extern volatile uint32_t   ADCEISTAT2 __attribute__((section("sfrs"), address(0xBF84B0FC)));
typedef struct {
  uint32_t EIRDY32:1;
  uint32_t EIRDY33:1;
  uint32_t EIRDY34:1;
  uint32_t EIRDY35:1;
  uint32_t EIRDY36:1;
  uint32_t EIRDY37:1;
  uint32_t EIRDY38:1;
  uint32_t EIRDY39:1;
  uint32_t EIRDY40:1;
  uint32_t EIRDY41:1;
  uint32_t EIRDY42:1;
  uint32_t EIRDY43:1;
  uint32_t EIRDY44:1;
} __ADCEISTAT2bits_t;
extern volatile __ADCEISTAT2bits_t ADCEISTAT2bits __asm__ ("ADCEISTAT2") __attribute__((section("sfrs"), address(0xBF84B0FC)));
#define ADCANCON ADCANCON
extern volatile uint32_t   ADCANCON __attribute__((section("sfrs"), address(0xBF84B100)));
typedef struct {
  uint32_t ANEN0:1;
  uint32_t ANEN1:1;
  uint32_t ANEN2:1;
  uint32_t ANEN3:1;
  uint32_t ANEN4:1;
  uint32_t :2;
  uint32_t ANEN7:1;
  uint32_t WKRDY0:1;
  uint32_t WKRDY1:1;
  uint32_t WKRDY2:1;
  uint32_t WKRDY3:1;
  uint32_t WKRDY4:1;
  uint32_t :2;
  uint32_t WKRDY7:1;
  uint32_t WKIEN0:1;
  uint32_t WKIEN1:1;
  uint32_t WKIEN2:1;
  uint32_t WKIEN3:1;
  uint32_t WKIEN4:1;
  uint32_t :2;
  uint32_t WKIEN7:1;
  uint32_t WKUPCLKCNT:4;
} __ADCANCONbits_t;
extern volatile __ADCANCONbits_t ADCANCONbits __asm__ ("ADCANCON") __attribute__((section("sfrs"), address(0xBF84B100)));
#define ADC0CFG ADC0CFG
extern volatile uint32_t   ADC0CFG __attribute__((section("sfrs"), address(0xBF84B180)));
typedef struct {
  uint32_t ADCCFG:32;
} __ADC0CFGbits_t;
extern volatile __ADC0CFGbits_t ADC0CFGbits __asm__ ("ADC0CFG") __attribute__((section("sfrs"), address(0xBF84B180)));
#define ADC1CFG ADC1CFG
extern volatile uint32_t   ADC1CFG __attribute__((section("sfrs"), address(0xBF84B184)));
typedef struct {
  uint32_t ADCCFG:32;
} __ADC1CFGbits_t;
extern volatile __ADC1CFGbits_t ADC1CFGbits __asm__ ("ADC1CFG") __attribute__((section("sfrs"), address(0xBF84B184)));
#define ADC2CFG ADC2CFG
extern volatile uint32_t   ADC2CFG __attribute__((section("sfrs"), address(0xBF84B188)));
typedef struct {
  uint32_t ADCCFG:32;
} __ADC2CFGbits_t;
